11/data/attachments/f7374c9907a261d2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_71a19caf-7aa7-42c1-be50-e2ef7b956cd0</nif:username>
            <nif:friendToBeAdded>Jennifer_church_Friend_23107_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>